In [1]:
import pandas as pd
import sqlite3 as sql

In [31]:
conn=sql.connect("staff.db")

In [10]:
df=pd.read_csv("./INSTRUCTOR.csv", names=['ID', 'FNAME', 'LNAME', 'CITY', 'CCODE'] )

In [13]:
df.to_sql("instructor",conn, if_exists="replace", index=False)

14

In [19]:
pd.read_sql("SELECT * FROM instructor",conn)

    ID    FNAME      LNAME      CITY CCODE
0    1      Rav      Ahuja   TORONTO    CA
1    2     Raul      Chong   Markham    CA
2    3     Hima  Vasudevan   Chicago    US
3    4     John     Thomas  Illinois    US
4    5    Alice      James  Illinois    US
5    6    Steve      Wells  Illinois    US
6    7  Santosh      Kumar  Illinois    US
7    8    Ahmed    Hussain  Illinois    US
8    9    Nancy      Allen  Illinois    US
9   10     Mary     Thomas  Illinois    US
10  11  Bharath      Gupta  Illinois    US
11  12   Andrea      Jones  Illinois    US
12  13      Ann      Jacob  Illinois    US
13  14     Amit      Kumar  NewDelhi    IN

In [21]:
pd.read_sql("SELECT FNAME, CITY FROM instructor",conn)

      FNAME      CITY
0       Rav   TORONTO
1      Raul   Markham
2      Hima   Chicago
3      John  Illinois
4     Alice  Illinois
5     Steve  Illinois
6   Santosh  Illinois
7     Ahmed  Illinois
8     Nancy  Illinois
9      Mary  Illinois
10  Bharath  Illinois
11   Andrea  Illinois
12      Ann  Illinois
13     Amit  NewDelhi

In [32]:
pd.read_sql("SELECT COUNT(*) FROM instructor",conn)

   COUNT(*)
0        15

In [26]:
#AGGIUNGO INFO AL DB
data_dict = {'ID' : [100],
            'FNAME' : ['John'],
            'LNAME' : ['Doe'],
            'CITY' : ['Paris'],
            'CCODE' : ['FR']}
data_append = pd.DataFrame(data_dict)

In [28]:
data_append.to_sql("instructor", conn, if_exists = 'append', index =False)
print('Data appended successfully')

Data appended successfully

In [29]:
conn.close()

In [ ]:
df2=pd.read("./Departments.csv", names=["DEPT_ID", "DEP_NAME", "MANAGER_ID", "LOC_ID"])